Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles.GetMultiDirectoryFileList Method
 Gets a list of files with the given extension from the default search directories.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<string> GetMultiDirectoryFileList(
	string fileExtension,
	bool fullpath = false
)
Public Function GetMultiDirectoryFileList (
	fileExtension As String,
	Optional fullpath As Boolean = false
) As List(Of String)
Parameters
fileExtension
Type: System.String
The file extension to be used.
fullpath (Optional)
Type: System.Boolean
If true, file with full path with extension is returned.
Return Value
Type: List<String>
A list of files with the given extension.
See Also
Reference
TeklaStructuresFiles Class
Tekla.Structures Namespace